Soap/account/samples/account_active.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_ACCOUNT xmlns="urn:amlyze-services:ImportAccountService_v1r0">
            <CommunicationNumber>ComNr_000321</CommunicationNumber>
            <Requester>financial_institution</Requester>
            <ListAccount>
                <Account>
                    <BusinessEntityExtId>ORG20231114T110356</BusinessEntityExtId>
                    <AccountExtId>Acc_00121</AccountExtId>
                    <AccountNumber>LT705734389447757988</AccountNumber>
                    <AccountStatus>ACTIVE</AccountStatus>
                    <BIC>BICXX22</BIC>
                    <CurrencyCode>EUR</CurrencyCode>
                    <OpeningDate>2023-09-16T12:10:11+02:00</OpeningDate>
                    <BankTitle>TBC bank</BankTitle>
                    <AccountPurpose>PURPOSE_INVEST</AccountPurpose>
                    <AccountType>ORG_B2B</AccountType>
                    <isOtherFinInstAccount>false</isOtherFinInstAccount>
                </Account>
            </ListAccount>
        </AMLYZE_ACCOUNT>
    </soap:Body>
</soap:Envelope>
